Table of Contents
 Class CalculationCase
Namespace
IdeaRS.OpenModel.Detail.Loading
Assembly
IdeaRS.OpenModel.dll
load case/combination data
public abstract class CalculationCase : OpenElementId
Inheritance
object
OpenObject
OpenElementId
CalculationCase
Derived
LoadCase
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CalculationCase()
constructor
public CalculationCase()
Properties
 IsActive
active load case/combination
public bool IsActive { get; set; }
Property Value
bool
 Name
Gets or set the name
public string Name { get; set; }
Property Value
string
 Edit this page